CDiamondGit/stm32SpaceInvaders/src/main.c
/* --- App / gameplay states ------------------------------------------------ */
typedef enum { MAINMENU, PLAYING, HELP, RECORD, MODE } AppState;

typedef enum { GAMERUNNING, PAUSE, GAMEOVER } PlayingState;
typedef enum { EASY, MEDIUM, HARD } GameMode;

/*
 * FUNCTION PROTOTYPES
 */
uint32_t xorshift32(void);
static uint8_t shouldFire(uint8_t threshold);
static uint32_t randomFireDelay(void);
static uint32_t randomMainAlienDelay(void);
uint8_t get_random_bit(uint32_t* state);
int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py);

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground(void);
void clearDisplay(void);

/* --- Game initialisation -------------------------------------------------- */
static void parkAlienBullet(int col);
static void initAlienGrid(void);
static void initGameState(void);
static void resetGame(void);

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as);
void help(AppState* as);
void getPause(PlayingState* ps, AppState* as);
void playing(AppState* as);
void showScoreBoard(AppState* as);
void selectMode(AppState* as, GameMode* gm);

/* --- Input
   ---------------------------------------------------------------- */
static void handleInput(PlayingState* ps, AppState* as);

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void);
static uint16_t getLowestAlienY(void);
static void moveAliens(uint32_t now);
static void updateAlienFire(uint32_t now);
static void moveMainAlien(MainAlien* ma);

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X,
                          uint16_t o1Y,
                          uint16_t o1w,
                          uint16_t o1h,
                          uint16_t o2X,
                          uint16_t o2Y,
                          uint16_t o2w,
                          uint16_t o2h);
static void resetAlienBullet(int col);
static void resetPlayerBullet(void);
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh);
static int updateAlienBulletCollision(void);
static void updatePlayerCollision(void);
static int checkGameOver(void);
static void updateMainAlienBulletCollision(void);

/* --- Rendering ------------------------------------------------------------ */
static void renderAliens(void);
static void renderShip(void);
static void renderPlayerBullet(void);
static void renderAlienBullets(void);
static void renderBarricade(void);
static void renderScene(void);
static void renderStats(void);
static void renderGameOverScreen(PlayingState* ps, AppState* as);
static void splashScreen();
static void makeBackground(int starCount);
static void buildRandomAlienPattern(void);
static void startAlienRespawn(void);
static void applyAlienRespawnPattern(void);
static void updateAlienRespawn(uint32_t now);

static void printAscii(void);

/*
 * GLOBAL DECLARATIONS
 */

/* --- Runtime game globals ------------------------------------------------- */
static uint32_t lastUpdate = 0;
static const uint32_t FRAME_DELAY = 16;  // 1000ms / 16 ms ~ 60 fps
// decrease to increase fps
// for eg if set to 8 => 1000ms / 8ms ~ 120 (display cant handle)
// in other words in a 1 second(1000 ms) 60 frames will be rendered if delay
// between frame is set to 16 ms so in code it can be used as, if difference
// between current and last updated time is less than FRAME_DELAY halt
// everything

AppState currentAppState = MAINMENU;
GameMode currentGameMode = EASY;

static GameState gs;
static uint32_t randState;

static ScoreRecord records[MAX_RECORDS] = {
    {"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000},
};

/*
 * ASSET DECLARATIONS
 */

static const uint16_t spaceShip[] = {

    0,     0,     0,     0,     0,     34882, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     34882, 37012, 37012, 54701, 0,     0,
    0,     0,     0,     0,     0,     0,     12692, 33585, 33585, 28820, 0,
    0,     0,     0,     0,     0,     0,     9521,  41769, 61181, 61181, 41769,
    42818, 0,     0,     0,     0,     0,     0,     10058, 49961, 18138, 18138,
    41769, 52595, 0,     0,     0,     0,     0,     21933, 52067, 49961, 18138,
    18138, 49961, 28292, 21933, 0,     0,     63414, 28820, 49961, 28027, 41769,
    41769, 41769, 41769, 19299, 41769, 37012, 63670, 35154, 37012, 49961, 28027,
    28820, 37012, 37012, 37012, 19299, 41769, 37012, 35154, 0,     35154, 41769,
    27755, 37012, 35154, 35154, 37012, 28292, 41769, 35154, 0,     0,     0,
    34361, 34361, 34369, 47302, 47302, 34882, 34361, 34361, 0,     0,     0,
    0,     0,     0,     34369, 34882, 33577, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     45196, 21933, 0,     0,     0,     0,
    0,
};

static const uint16_t blueAlienBoth[][88] = {
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     41187, 0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     0,     0,     41187, 0},
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     0,     0,     41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     41187, 41187, 41187, 41187, 0,     41187, 41187, 0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     41187, 0,     0,     0,
     41187, 41187, 0,     41187, 41187, 0,     0,     0}};
static const uint16_t redAlien[][88] = {

    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     65320, 0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     0,     0,     65320, 0,
    },
    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     0,     0,     65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        65320, 65320, 65320, 65320, 0,     65320, 65320, 0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     65320, 0,     0,     0,
        65320, 65320, 0,     65320, 65320, 0,     0,     0,
    }};
static const uint16_t greenAlien[][88] = {
    {0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
     0,     51975, 0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
     51975, 0,     51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
     0,     51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     0,     0,     51975, 0},
    {
        0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 0,     0,     0,     51975, 51975, 0,     51975, 51975, 51975,
        0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
        51975, 51975, 51975, 51975, 0,     51975, 51975, 0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     51975, 0,     0,     0,
        51975, 51975, 0,     51975, 51975, 0,     0,     0,
    }};
static const uint16_t explosion[88] = {
    0,    0,     0,     0,     0,     0,     21809, 2105,  1073,  2105,  0,
    2105, 61747, 53562, 21809, 53562, 61747, 15139, 15139, 2105,  2105,  2105,
    0,    1073,  21809, 32158, 15139, 64354, 24375, 7013,  24375, 2105,  2105,
    0,    15139, 7013,  15139, 24375, 32158, 24375, 7013,  64354, 53562, 0,
    0,    61747, 7013,  7013,  24375, 24375, 24375, 15139, 7013,  53562, 0,
    0,    15139, 15139, 21809, 15139, 15139, 7013,  7013,  21809, 11313, 0,
    0,    0,     0,     7013,  61747, 7013,  32158, 64354, 11313, 0,     0,
    0,    0,     0,     53562, 1073,  21809, 61747, 2105,  0,     0,     0};

static const uint16_t mainAlienSpr[352] = {
    0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,
    0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,
    65320, 0,     0,     0,     0,     0,     65320, 65320, 0,     65320, 0,
    0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,     65320,
    65320, 65320, 0,     0,     0,     0,     65320, 65320, 0,     0,     0,
    65320, 0,     0,     65320, 65320, 0,     0,     0,     0,     65320, 65320,
    65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320,
    65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65321, 27663, 27663, 65320, 65321, 65320,
    65320, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65321, 27663, 27663, 65320, 65320, 65320,
    65320, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320,
    65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320,
    65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 27663, 27663, 65321, 65320, 27663,
    27663, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    0,     65320, 65320, 65320, 65320, 65320, 27663, 27663, 65320, 65320, 27663,
    27663, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 0,
    0,     65320, 65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320, 65320, 0,
    0,     65320, 65320, 65320, 16151, 0,     65320, 65320, 17144, 17144, 65320,
    65320, 17144, 17144, 65320, 65320, 0,     0,     65320, 65320, 65320, 0,
    0,     0,     65320, 65320, 0,     0,     0,     0,     17144, 17144, 0,
    0,     17144, 17144, 0,     0,     0,     0,     65320, 65320, 0,     0,
    0,     0,     65320, 65320, 0,     0,     0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     0,     0,     65320, 65320, 0,     0,
};

static const uint16_t respawn_flicker[88] = {
    0,     65535, 0, 0,     0, 0, 0,     0, 0,     65535, 0,     0, 0,
    65535, 0,     0, 0,     0, 0, 65535, 0, 0,     0,     0,     0, 65535,
    0,     0,     0, 65535, 0, 0, 0,     0, 0,     0,     0,     0, 0,
    0,     0,     0, 0,     0, 0, 0,     0, 0,     0,     0,     0, 0,
    0,     0,     0, 0,     0, 0, 65535, 0, 0,     0,     65535, 0, 0,
    0,     0,     0, 65535, 0, 0, 0,     0, 0,     65535, 0,     0, 0,
    65535, 0,     0, 0,     0, 0, 0,     0, 65535, 0,
};

