CDiamondGit/stm32SpaceInvaders/src/main.c
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      ag->status[i][j] = ag->nextStatus[i][j];
    }
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    parkAlienBullet(j);
    ag->nextFireTime[j] = milliseconds + randomFireDelay();
  }

  ag->respawning = 0;
  ag->previewVisible = 0;
  ag->flashStep = 0;
  ag->redrawAll = 1;
  ag->lastMoveTime = milliseconds;
  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;
}

static void updateAlienRespawn(uint32_t now) {
  AlienGrid* ag = &gs.aliens;

  if (!ag->respawning)
    return;

  if (now - ag->respawnTimer < ALIEN_RESPAWN_FLASH_MS)
    return;

  ag->respawnTimer = now;
  ag->flashStep++;

  switch (ag->flashStep) {
    case 1:
    case 3:
    case 5:
      ag->previewVisible = 1;
      ag->redrawAll = 1;
      start_sound_effect_ch1(aliens_spawning_notes, aliens_spawning_times,
                             aliens_spawning_note_count, 0);
      break;

    case 2:
    case 4:
    case 6:
      ag->previewVisible = 0;
      ag->redrawAll = 1;
      break;

    case 7:
      applyAlienRespawnPattern();
      break;
  }
}

static void initMainAlien(MainAlien* ma) {
  ma->coords.x = 0;
  ma->coords.y = MAIN_ALIEN_Y;
  ma->coords.oldX = 0;
  ma->coords.oldY = MAIN_ALIEN_Y;

  ma->speed = 2;
  ma->dir = 1;
  ma->active = 0;

  ma->nextSpawnTime = milliseconds + randomMainAlienDelay();
  ma->lastMoveTime = 0;
}

static void initGameState() {
  gs.highScore = records[0].score;
  randState = milliseconds | 1; /* Ship */

  if (currentGameMode == EASY) {
    gs.alienSpeed = ALIEN_MOVE_MS_EASY;
    gs.score_inc = SCORE_INC_EASY;
  } else if (currentGameMode == MEDIUM) {
    gs.alienSpeed = ALIEN_MOVE_MS_MED;
    gs.score_inc = SCORE_INC_MED;
  } else {
    gs.alienSpeed = ALIEN_MOVE_MS_HARD;
    gs.score_inc = SCORE_INC_HARD;
  }

  gs.ship.coords.x = gs.ship.coords.oldX = 58;
  gs.ship.coords.y = gs.ship.coords.oldY = 130;
  gs.ship.speed = SHIP_SPEED;

  /* Bullet - parked at muzzle */
  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
  gs.bullet.speed = BULLET_SPEED;
  gs.bullet.state = BULLET_READY;

  /* Alien grid */
  initAlienGrid();
  /* Main alien*/
  initMainAlien(&gs.mysteryAlien);
}
static void resetGame(void) {
  /* Blank the whole play area above the HUD line */
  fillRectangle(0, 0, SCREEN_W, HUD_LINE_Y, 0);

  /* Re-initialise all game state */
  initGameState();  // 0 to preserve Alien Grid

  /* Redraw the initial scene */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  /* HUD line stays - was never erased */
}

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as) {
  clearDisplay();

  loadBackground();

  int selectedOption = 0;

  uint16_t normal = RGBToWord(0xff, 0xff, 0);
  uint16_t highlighted = RGBToWord(211, 211, 211);
  uint16_t startButton = normal;
  uint16_t helpButton = normal;
  uint16_t scoreButton = normal;
  uint16_t modeButton = normal;

  int done = 0;

  while (!done) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    if (selectedOption == 0) {
      startButton = highlighted;
      helpButton = normal;
      scoreButton = normal;
      modeButton = normal;
    }
    if (selectedOption == 1) {
      helpButton = highlighted;
      scoreButton = normal;
      startButton = normal;
      modeButton = normal;
    }
    if (selectedOption == 2) {
      scoreButton = highlighted;
      startButton = normal;
      helpButton = normal;
      modeButton = normal;
    }

    if (selectedOption == 3) {
      modeButton = highlighted;
      startButton = normal;
      helpButton = normal;
      scoreButton = normal;
    }

    printText("Start Game", 20, 60, startButton, 0);
    printText("Help", 20, 80, helpButton, 0);
    printText("High Scores", 20, 100, scoreButton, 0);
    printText("Select Mode", 20, 120, modeButton, 0);

    if (((GPIOA->IDR & (1 << 11)) == 0) || c == 's' || c == 'S') {
      while ((GPIOA->IDR & (1 << 11)) == 0)
        ; /* wait for release */
      delay(50);

      if (selectedOption < 3) {
        selectedOption++;
        delay(100);
      }
    }

    if (((GPIOA->IDR & (1 << 8)) == 0) || c == 'w' || c == 'W') {
      while ((GPIOA->IDR & (1 << 11)) == 0)
        ; /* wait for release */
      delay(50);
      if (selectedOption > 0) {
        selectedOption--;
        delay(100);
      }
    }

    if (((GPIOB->IDR & (1 << 4)) == 0) || c == ' ' || c == '\r' || c == '\n' ||
        c == 'd' || c == 'D') {
      if (selectedOption == 0) {
        *as = PLAYING;
        done = 1;
      }
      if (selectedOption == 1) {
        *as = HELP;
        done = 1;
      }
      if (selectedOption == 2) {
        *as = RECORD;
        done = 1;
      }
      if (selectedOption == 3) {
        *as = MODE;
        done = 1;
      }
    }
  }
}
void help(AppState* as) {
  clearDisplay();

  int done = 0;

  while (!done) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    printTextX2("HELP", 40, 0, RGBToWord(255, 255, 0), 0);

    printText("Control spaceship:", 0, 20, RGBToWord(255, 255, 255), 0);
    printText("Left/Right buttons", 0, 30, RGBToWord(255, 255, 255), 0);
    printText("FIRE = UP BUTTON", 0, 60, RGBToWord(255, 255, 255), 0);
    printText("PAUSE = DOWN BUTTON", 0, 80, RGBToWord(255, 255, 255), 0);

    printText("EXIT HELP = DOWN BUTTON", 0, 120, RGBToWord(255, 255, 255), 0);

    if (((GPIOA->IDR & (1 << 11)) == 0) || c == 's' || c == 'S' || c == '\r' ||
        c == '\n') {
      *as = MAINMENU;
      done = 1;
    }
  }
}

void selectMode(AppState* as, GameMode* gm) {
  clearDisplay();

  loadBackground();
  printText("Game Level:", 20, 40, 65535, 0);

  int selectedOption = *gm;

  uint16_t normal = RGBToWord(0xff, 0xff, 0);
  uint16_t highlighted = RGBToWord(211, 211, 211);
  uint16_t startButton = normal;
  uint16_t helpButton = normal;
  uint16_t scoreButton = normal;

  while (1) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    if (selectedOption == 0) {
      startButton = highlighted;
      helpButton = normal;
      scoreButton = normal;
    }
    if (selectedOption == 1) {
      helpButton = highlighted;
      scoreButton = normal;
      startButton = normal;
    }
    if (selectedOption == 2) {
      scoreButton = highlighted;
      startButton = normal;
      helpButton = normal;
    }

