CDiamondGit/stm32SpaceInvaders/src/main.c
          alpha = 'A';
          alphaStr[0] = alpha;
          fillRectangle(60, 60, 14, 16, 0);
          printTextX2(alphaStr, 60, 60, pinkColor, 0);

          delay(200);
        }
      }
    save_and_exit:

      /* Save to leaderboard */

      newEntry.initials[0] = initials[0];
      newEntry.initials[1] = initials[1];
      newEntry.initials[2] = initials[2];
      newEntry.initials[3] = '\0';
      newEntry.score = gs.score;

      for (int i = 0; i < MAX_RECORDS; i++) {
        if (newEntry.score > records[i].score) {
          for (int k = MAX_RECORDS - 1; k > i; k--)
            records[k] = records[k - 1];
          records[i] = newEntry;
          break;
        }
      }

      if (gs.score > gs.highScore) {
        gs.highScore = gs.score;
      }
      gs.score = 0;
      stop_sound_effect_ch1();
      stop_sound_effect_ch2();
      *ps = GAMERUNNING;
      *as = MAINMENU;
      return;
    } else {
      while (1) {
        stop_sound_effect_ch1();
        stop_sound_effect_ch2();
        putImage(55, 20, 11, 8, blueAlienBoth[1], 0, 1);
        printText("Press down key", 10, 125, RGBToWord(255, 255, 255), 0);
        printText("to go to main menu", 10, 135, RGBToWord(255, 255, 255), 0);

        if (!(GPIOA->IDR & (1 << 11))) {  // down key to save and exit
          gs.score = 0;

          *ps = GAMERUNNING;
          *as = MAINMENU;
          delay(200);
          return;
        }
      }
    }
  } else {
    stop_sound_effect_ch2();
    /* Draw pause menu */
    fillRectangle(0, 60, SCREEN_W, 50, 0);
    printTextBold("PAUSED", 35, 65, RGBToWord(255, 255, 0), 0);
    printText("> Resume", 10, 82, RGBToWord(255, 255, 255), 0);
    printText("  Main Menu", 10, 94, RGBToWord(255, 255, 255), 0);

    /* Wait for button release first (debounce the PA11 press that got us
     * here)
     */
    while ((GPIOA->IDR & (1 << 11)) == 0)
      ;
    delay(50);

    while (1) {
      char c = 0;

      if (serialCharAvailable()) {
        c = serialGetCharNonBlocking();
      }

      if (c != 0) {
        eputchar(c);
        eputchar('\r\n');
      }

      /* Highlight selected option */
      printText(selected == 0 ? "> Resume   " : "  Resume   ", 10, 82,
                RGBToWord(255, 255, 255), 0);
      printText(selected == 1 ? "> Main Menu" : "  Main Menu", 10, 94,
                RGBToWord(255, 255, 255), 0);

      /* Down button - move selection down */
      if ((GPIOA->IDR & (1 << 11)) == 0 || (c == 's') || (c == 'S')) {
        selected = !selected; /* toggle between 0 and 1 */
        delay(150);           /* debounce                */
      }

      /* Right/confirm button - PB4 */
      if ((GPIOB->IDR & (1 << 4)) == 0 || (c == 'd') || (c == 'D')) {
        delay(50);
        if (selected == 0) {
          /* Resume */
          fillRectangle(0, 60, SCREEN_W, 50, 0);
          start_sound_effect_ch2(game_loop_notes, game_loop_times,
                                 game_loop_note_count, 1);
          *ps = GAMERUNNING;
          return;
        } else {
          /* Quit to main menu */
          stop_sound_effect_ch1();
          stop_sound_effect_ch2();
          *as = MAINMENU;
          *ps = GAMERUNNING; /* reset state for next play session */
          return;
        }
      }
    }
  }
}

void playing(AppState* as) {
  clearDisplay();

  /* Game */
  gs.lives = 3;
  gs.score = 0;

  initGameState();

  delay(300);

  /* Initial draw */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  drawLine(0, HUD_LINE_Y, SCREEN_W, HUD_LINE_Y, HUD_LINE_COLOR);

  start_sound_effect_ch2(game_loop_notes, game_loop_times, game_loop_note_count,
                         1);

  PlayingState currentPlayingState = GAMERUNNING;

  /* Game loop */
  while (1) {
    uint32_t now = milliseconds;
    if (now - lastUpdate < FRAME_DELAY)
      continue;
    lastUpdate = now;

    if (currentPlayingState == PAUSE) {
      getPause(&currentPlayingState, as);
      continue; /* skip this frame, resume next tick */
    }

    /* Advance bullet */
    if (gs.bullet.state == BULLET_FIRE) {
      gs.bullet.coords.y -= gs.bullet.speed;
      if (gs.bullet.coords.y < 5) {
        resetPlayerBullet();
        // renderPlayerBullet();
      }
    } else {
      gs.bullet.coords.x = gs.ship.coords.x + BULLET_OFFSET_X;
      gs.bullet.coords.y = gs.ship.coords.y - BULLET_OFFSET_Y;
    }

    handleInput(&currentPlayingState, as); /* buttons-> positions*/

    if (*as == MAINMENU)
      return;

    if (currentPlayingState == PAUSE) {
      getPause(&currentPlayingState, as);
      if (*as == MAINMENU)
        return; /* quit was selected */
      continue;
    }

    updateMainAlienBulletCollision();
    moveMainAlien(&gs.mysteryAlien);

    AlienGrid* ag = &gs.aliens;

    if (!ag->respawning) {
      for (int j = 0; j < ALIEN_COLS; j++) {
        Bullet* b = &ag->ab[j];
        if (b->state == BULLET_FIRE) {
          b->coords.y += b->speed; /* alien bullets go DOWN */
          if (b->coords.y > HUD_LINE_Y - 5)
            resetAlienBullet(j);
        }
      }

      moveAliens(now);
      updateAlienFire(now);
      updatePlayerCollision();
    } else {
      updateAlienRespawn(now);
    }

    if (updateAlienBulletCollision()) {
      // stop_sound_effect_ch2();
      gs.lives -= 1;
      putImage(gs.ship.coords.x, gs.ship.coords.y, ALIEN_W, ALIEN_H, explosion,
               1, 0);
      // delay(200);
      start_sound_effect_ch1(lose_life_notes, lose_life_times,
                             lose_life_note_count, 0);

      delay(350);

      resetGame();

      continue;
    }

    if (checkGameOver()) {
      gs.lives -= 1;
      currentPlayingState = GAMEOVER;
      lightLivesIndicator(gs.lives);
      stop_sound_effect_ch1();
      stop_sound_effect_ch2();
      renderGameOverScreen(&currentPlayingState, as);
      continue;
    }

    renderScene(); /* positions -> screen           */
    lightLivesIndicator(gs.lives);
  }
}

/* --- Input ----------------------------------------------------------------
 */

static void handleInput(PlayingState* ps, AppState* as) {
  char c = 0;

  if (serialCharAvailable()) {
    c = serialGetCharNonBlocking();
  }

  if (c != 0) {
    eputchar(c);
    eputchar('\r\n');
  }

