CDiamondGit/stm32SpaceInvaders/src/main.c
static void updatePlayerCollision(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue; /* already dead */

      /* Absolute screen position = grid origin + relative cell offset */
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);

      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, gs.bullet.coords.x,
                         gs.bullet.coords.y, BULLET_W, BULLET_H)) {
        putImage(ax, ay, ALIEN_W, ALIEN_H, explosion, 1, 0);
        delay(50);
        fillRectangle(ax, ay, ALIEN_W, ALIEN_H, 0);

        ag->status[i][j] = 1;
        start_sound_effect_ch1(explode_notes, explode_times, explode_note_count,
                               0);

        /* Park the alien bullet for this column (shooter is dead) */
        resetAlienBullet(j);
        resetPlayerBullet();

        /* Increase the score..... */

        gs.score += gs.score_inc;
        return; /* one hit per frame */
      }
    }
  }
}
static int checkGameOver(void) {
  uint16_t lowestY = getLowestAlienY();

  if (gs.lives == 0) {
    return 1;
  }

  if (lowestY == 0)
    return 0; /* no aliens left - nothing to check */

  /* Condition 1: aliens reached the HUD line */
  if (lowestY >= HUD_LINE_Y)
    return 1;

  /* Condition 2: any alive alien overlaps the ship */
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, gs.ship.coords.x,
                         gs.ship.coords.y, SHIP_W, SHIP_H))
        return 1;
    }
  }
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H))
      return 1;
  }
  return 0;
}

/* --- Rendering ------------------------------------------------------------
 */
/*
 * renderAliens - full grid redraw.
 * Used at startup, level reset, and after every move tick.
 *
 * On a move tick the dirty-strip strategy is used:
 *   1. Erase the vacated edge strip (one fillRectangle call).
 *   2. Blit only alive aliens - dead cells stay black automatically
 *      because the strip erase already cleared them.
 */
static void renderAliens(void) {
  AlienGrid* ag = &gs.aliens;

  /* Nothing changed this frame - skip entirely */
  if (!ag->redrawAll && !ag->respawning && ag->offsetX == ag->oldOffsetX &&
      ag->offsetY == ag->oldOffsetY)
    return;

  /* 1. Erase the full bounding box at the OLD position */
  if (ag->redrawAll || ag->respawning) {
    fillRectangle((uint16_t)ag->offsetX, (uint16_t)ag->offsetY, ALIEN_GRID_W,
                  ALIEN_GRID_H, 0);
  } else {
    fillRectangle((uint16_t)ag->oldOffsetX, (uint16_t)ag->oldOffsetY,
                  ALIEN_GRID_W, ALIEN_GRID_H, 0);
  }

  /* 2. Blit alive aliens at the NEW position */
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->respawning) {
        if (ag->previewVisible && ag->nextStatus[i][j] == 0) {
          putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                   (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                   respawn_flicker, 1, 0);
        }
        continue;
      }

      if (ag->status[i][j] != 0)
        continue;

      if (i == 0) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 redAlien[ag->earToggle], 1, 0);
      }
      if (i == 1) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 greenAlien[ag->earToggle], 1, 0);
      }
      if (i >= 2) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 blueAlienBoth[ag->earToggle], 1, 0);
      }
    }
  }

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;
  ag->redrawAll = 0;
}
/*
 * Serial output function:
 * Print hello world
 */
static void printAscii(void) {
  eputs("\r\nGood luck! You'll need it.\r\n");
  eputs("\r\n    @@          @@    \r\n");
  eputs("\r\n      @@      @@      \r\n");
  eputs("\r\n    @@@@@@@@@@@@@@    \r\n");
  eputs("\r\n  @@@@  @@@@@@  @@@@  \r\n");
  eputs("\r\n@@@@@@@@@@@@@@@@@@@@@@\r\n");
  eputs("\r\n@@  @@@@@@@@@@@@@@  @@\r\n");
  eputs("\r\n@@  @@          @@  @@\r\n");
  eputs("\r\n      @@@@  @@@@      \r\n");
}

/*
Dirty-rect ship: erase only the vacated edge strip
*/
static void renderShip(void) {
  if (gs.ship.coords.oldX == gs.ship.coords.x &&
      gs.ship.coords.oldY == gs.ship.coords.y)
    return;

  int16_t dx = (int16_t)gs.ship.coords.x - gs.ship.coords.oldX;

  if (dx > 0)
    fillRectangle(gs.ship.coords.oldX, gs.ship.coords.oldY, (uint16_t)dx,
                  SHIP_H, 0);
  else if (dx < 0)
    fillRectangle(gs.ship.coords.x + SHIP_W, gs.ship.coords.oldY,
                  (uint16_t)(-dx), SHIP_H, 0);

  gs.ship.coords.oldX = gs.ship.coords.x;
  gs.ship.coords.oldY = gs.ship.coords.y;
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
}
/*
Erase tail strip only, draw new bullet head
*/
static void renderPlayerBullet(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  Bullet* b = &gs.bullet;
  fillRectangle(b->coords.oldX, b->coords.oldY + BULLET_H, BULLET_W, b->speed,
                0);
  b->coords.oldX = b->coords.x;
  b->coords.oldY = b->coords.y;
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, BULLET_COLOR);
}
static void renderAlienBullets(void) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;

    /* 1. Erase old position */
    fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);

    /* 2. Repair aliens whose pixels the erase may have destroyed */
    repairAliensUnderRect(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H);

